config.org
#+title: Emacs configuration

* About me
#+begin_src emacs-lisp
(setq user-full-name "Yejun Su"
      user-mail-address "yejun@hey.com")
#+end_src

* Appearance
** Theme
#+begin_src emacs-lisp
(setq doom-theme 'doom-dracula)
#+end_src

** Font
#+begin_src emacs-lisp
(setq doom-font (font-spec :family "JetBrains Mono" :size 16)
      doom-serif-font (font-spec :family "Courier New" :size 16)
      doom-variable-pitch-font (font-spec :family "Times New Roman" :size 16))
#+end_src

* Organize everything
#+begin_src emacs-lisp
(setq org-directory "~/org/")
#+end_src

** Import anything to Org Mode
#+begin_src emacs-lisp
(use-package! org-pandoc-import :after org)
#+end_src
* Reading
** RSS
#+begin_src emacs-lisp
(use-package! elfeed
  :bind ("s-r" . elfeed))
#+end_src

* Coding
** Don't check syntax when editing
#+begin_src emacs-lisp
(after! flycheck
  (delq 'idle-change flycheck-check-syntax-automatically))
#+end_src

* Languages
** Elixir
#+begin_src emacs-lisp
(use-package! elixir-mode
  :hook (before-save . elixir-format-before-save)
  :config
  (defun elixir-format-before-save ()
    (when (derived-mode-p 'elixir-mode)
      (eglot-format-buffer))))
#+end_src

** Nix
#+begin_src emacs-lisp
(use-package! nix-mode
  :hook (before-save . nix-format-before-save))
#+end_src

* Tools
** GitHub Gist
#+begin_src emacs-lisp
(use-package! gist
  :config
  (map! :leader
        :desc "Gist buffer/region" "cg" #'gist-region-or-buffer-private))
#+end_src

** ChatGPT
#+begin_src emacs-lisp
(use-package! chatgpt-shell
  :custom
  (chatgpt-shell-model-version 2)
  (chatgpt-shell-welcome-function nil)
  (chatgpt-shell-openai-key (lambda () (auth-source-pick-first-password :host "api.openai.com")))
  :config
  (map! :leader
        :prefix ("z" . "chatgpt-shell")
        "z" #'chatgpt-shell
        "b" #'chatgpt-shell-prompt
        "c" #'chatgpt-shell-prompt-compose
        "s" #'chatgpt-shell-send-region
        "S" #'chatgpt-shell-send-and-review-region
        "e" #'chatgpt-shell-explain-code
        "r" #'chatgpt-shell-refactor-code)

  (set-popup-rules!
    '(("^\\*chatgpt\\*" :side bottom :size 0.5 :select t)
      ("^ChatGPT>" :side bottom :size 0.5 :select t))))
#+end_src

** Dash.app
#+begin_src emacs-lisp
(use-package! dash-at-point
  :config
  (map! :leader
        "sk" #'dash-at-point
        "sK" #'dash-at-point-with-docset))
#+end_src

** Vanilla Emacs
I'm building my own Emacs configuration [[https://github.com/goofansu/.emacs.d][here]].

#+begin_src emacs-lisp
(defun yejun/launch-vanilla-emacs ()
  (interactive)
  (let ((default-directory "~/src/.emacs.d/"))
    (start-process "Emacs" nil "emacs" "-q" "-l" "init.el" "config.org")))

(global-set-key (kbd "s-e") #'yejun/launch-vanilla-emacs)
#+end_src

** IRC client
#+begin_src emacs-lisp
(set-irc-server! "Libera Chat"
  '(:host "irc.libera.chat"
    :port 6697
    :nick "goofansu"
    :channels ("#emacs" "#elixir" "nixos")
    :nickserv-password (lambda (server) (auth-source-pick-first-password :host server))))

(global-set-key (kbd "s-k") #'+irc/jump-to-channel)
#+end_src
